{
  "nav": {
    "home": "Home",
    "aboutMe": "A proposito di me",
    "skills": "Le mie competenze",
    "contact": "Contatti"
  },
  "home": {
    "title": "Ciao, Mi chiamo Pablo",
    "frontend": "Frontend Developer ",
    "backend": "Backend Developer ",
    "description": "Benvenuti nel mio portfolio! Sono uno sviluppatore Full Stack specializzato in React, Node.js e React Native, con conoscenze anche in Vue.js. Creo applicazioni web e mobile moderne, intuitive e performanti, trasformando idee in esperienze digitali complete.",
    "aboutMe": "A propsito di me"
  },
  "aboutMe": {
    "title": "A proposito di me",
    "name": "Nome",
    "bornOn": "Nato il",
    "residence": "Residenza",
    "email": "Indirizzo email",
    "italy": "Italia",
    "dateOfBirth": "9 novembre ,1989",
    "description": "Ciao. mi chiamo Pablo Munoz, sono uno sviluppatore Frontend e Backend, ho conoscenza ed sperienza nello sviluppo di applicazioni web basati su HTM5, CSS3,\n            ReactJS, ExpressJs, MongoDB e MySql.\n            Sono una persona autodidatta con molta voglia di imparare nuove tecnologie ed espandere i miei orizzonti."
  },
  "skills": {
    "title": "Le mie Skills"
  },
  "contact": {
    "title": "Contatti"
  },
  "animio": {
    "privacy": {
      "title": "Privacy Policy – Animio",
      "lastUpdated": "Ultimo aggiornamento",
      "lastUpdatedDate": "30 agosto 2025",
      "index": "Indice",
      "sections": {
        "intro": "Introduzione",
        "data": "Dati raccolti",
        "purpose": "Finalità del trattamento",
        "legal": "Basi giuridiche (GDPR)",
        "sharing": "Condivisione dei dati",
        "retention": "Conservazione",
        "security": "Sicurezza",
        "rights": "Diritti degli utenti",
        "minors": "Privacy dei minori",
        "thirdparties": "Servizi di terze parti",
        "cookies": "Cookie e tecnologie simili",
        "contact": "Contatti",
        "changes": "Modifiche alla policy"
      },
      "content": {
        "intro": "Animio rispetta la privacy degli utenti e si impegna a proteggere i dati personali e le informazioni relative agli animali domestici. Questa informativa descrive come vengono raccolti, utilizzati e protetti i dati durante l’utilizzo dell’app Animio.",
        "data": "Animio può raccogliere: dati dei profili animali (nome, specie/razza, età, sesso, foto, note), dati relativi a visite veterinarie, geolocalizzazione se abilitata, dati tecnici del dispositivo, dati di contatto se forniti.",
        "purpose": "I dati raccolti sono utilizzati per gestire i profili degli animali, mostrare veterinari vicini, inviare promemoria e notifiche, migliorare qualità e sicurezza dell’app e fornire supporto agli utenti.",
        "legal": "Il trattamento dei dati si basa su: esecuzione del contratto, consenso per funzionalità opzionali, interesse legittimo per sicurezza e miglioramento, obblighi legali.",
        "sharing": "I dati personali non vengono venduti a terzi. Condivisi solo con fornitori come Supabase e servizi mappe (Apple/Google Maps) o messaggistica necessari al funzionamento dell’app.",
        "retention": "I dati vengono conservati per il tempo necessario a fornire i servizi e adempiere agli obblighi di legge. L’utente può richiedere la cancellazione in qualsiasi momento.",
        "security": "Le comunicazioni tra l’app e il server sono protette tramite HTTPS/TLS e sono adottate misure tecniche e organizzative per proteggere i dati.",
        "rights": "L’utente ha diritto ad accedere, modificare, cancellare i dati, limitarne il trattamento, opporti, richiedere portabilità o revocare il consenso.",
        "minors": "L’app non è destinata a minori di 14 anni. Non vengono raccolti consapevolmente dati di minori. I genitori o tutori possono richiederne la rimozione.",
        "thirdparties": "L’app può integrare servizi di terze parti che trattano i dati secondo le proprie policy.",
        "cookies": "L’app mobile non utilizza cookie. Il sito può usare cookie tecnici o analitici, gestibili dal browser.",
        "contact": "Titolare del trattamento: Pablo Munoz – Email: pablo.munoz05@hotmail.com – Sito web: https://www.pablo-munoz.com",
        "changes": "Questa Privacy Policy può essere aggiornata periodicamente. Le modifiche saranno pubblicate su questa pagina."
      },
      "disclaimer": ""
    },
    "resetPassword": {
      "title": "Reset Password – Animio",
      "description": "Inserisci la nuova password per il tuo account Animio.",
      "newPassword": "Nuova password",
      "confirmPassword": "Conferma password",
      "button": "Aggiorna password",
      "messages": {
        "success": "Password aggiornata con successo! Ora puoi accedere all’app Animio.",
        "mismatch": "Le password non coincidono.",
        "invalid": "Link non valido o scaduto. Richiedi di nuovo il reset.",
        "short": "La password deve avere almeno 6 caratteri.",
        "session": "Errore durante la creazione della sessione."
      }
    },
    "deleteAccount": {
      "title": "Eliminazione account – Animio",
      "description": "Per eliminare definitivamente il tuo account Animio e tutti i dati associati, invia una email all'indirizzo indicato con oggetto \"Elimina account Animio\".",
      "instructions": "Nella mail, indica il tuo username o indirizzo email registrato per facilitare l’eliminazione.",
      "dataDeleted": "I dati che verranno eliminati includono:",
      "dataItems": [
        "Profilo animali (nome, specie, età, note)",
        "Cronologia visite veterinarie",
        "Email / login"
      ],
      "processing": "I dati saranno eliminati entro 30 giorni dalla richiesta. Una volta ricevuta la tua email, il tuo account entrerà in fase di eliminazione.",
      "contact": "Puoi contattarci allo stesso indirizzo per qualsiasi informazione sul trattamento dei tuoi dati.",
      "button": "Invia richiesta di eliminazione"
    }
  }
}